MD1/app/Controllers/Customers.php

SELECT *
FROM `customers`
ORDER BY `id` DESC
---
    public function index(): string
    {
        $customers = new CustomerModel();

        return view('customers/index', [
            'title'     => 'Customer Accounts',
            'page'      => 'customers',
            'customers' => $customers->findAll(),
        ]);