MD1/app/Controllers/Profile.php

    public function index(): string
    {
        $user = new UserModel();

        return view('profile/index', [
            'title' => 'Profile',
            'page'  => 'profile',
            'user'  => $user->first(),
---
SELECT *
FROM `users`
 LIMIT 1