MD1/app/Controllers/Users.php

    public function index(): string
    {
        $users = new UserModel();

        return view('users/index', [
            'title' => 'User Accounts',
            'page'  => 'users',
            'users' => $users->findAll(),
        ]);
---
SELECT *
FROM `users`
ORDER BY `id` DESC