MD1/app/Models/TaskModel.php

SELECT *
FROM `tasks`
WHERE `task_date` = '2026-10-09'
ORDER BY `created_at` ASC
---
    public function forToday(?string $date = null): array
    {
        return $this->where('task_date', $date ?? date('Y-m-d'))
            ->orderBy('created_at', 'ASC')
            ->findAll();

SELECT *
FROM `tasks`
ORDER BY `task_date` ASC, `created_at` ASC
---
    public function orderedByDate(): array
    {
        return $this->orderBy('task_date', 'ASC')
            ->orderBy('created_at', 'ASC')
            ->findAll();